# taps
tap 'koekeishiya/formulae'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# CLI
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# core
brew 'coreutils'

# window manager
brew 'yabai'

# hotkey daemon
brew 'skhd'

# shell
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

# multiplexer
brew 'tmux'

# editor
brew 'vim'
brew 'neovim'
brew 'editorconfig'

# file browser
brew 'ranger'

# fuzzy finder
brew 'fzf'

# find replacement
brew 'fd'

# ls and tree replacement
brew 'exa'

# ag
brew 'the_silver_searcher'

# grep replacement
brew 'ripgrep'

# git + hub extension
brew 'git'
brew 'git-delta'
brew 'hub'

# cloud
brew 'azure-cli'
brew 'awscli'

# yarn
brew 'yarn'

# python
brew 'python'

# node
brew 'node'
brew 'nvm'

# postgresql
brew 'postgresql'

# redis
brew 'redis'

# ansible
brew 'ansible'

# terraform
brew 'terraform'
brew 'tflint'

# misc
brew 'openssl'
brew 'fx'
brew 'jq'
brew 'rclone'
brew 'exiftool'
brew 'imagemagick'
brew 'trash'
brew 'direnv'
brew 'pyenv'
brew 'reattach-to-user-namespace' # copying in tmux vi-mode. See tmux.conf
brew 'tree'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Fonts
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-fira-code'
cask 'font-fontawesome' # spacbar icons

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Applications
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# terminal emulator
cask 'alacritty'

# editor
cask 'visual-studio-code'

# bar
brew 'cmacrae/formulae/spacebar'

# utils
cask 'alfred'

# browsers
cask 'google-chrome'
cask 'firefox-developer-edition'

# comms
cask 'slack'
cask 'discord'
cask 'telegram'

# password manager
cask 'keeweb'

# dev
cask 'docker'
cask 'insomnia'
cask 'miniconda'
