# taps
tap 'caskroom/cask'
tap 'koekeishiya/formulae'
tap 'homebrew/cask-fonts'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# CLI
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# core
brew 'coreutils'

# window manager
brew 'yabai'

# hotkey daemon
brew 'skhd'

# shell
brew 'zsh'

# multiplexer
brew 'tmux'

# editor
brew 'vim'
brew 'neovim'
brew 'editorconfig'

# directory jumper
brew 'z'

# file browser
brew 'ranger'

# fuzzy finder
brew 'fzf'

# find replacement
brew 'fd'

# ls and tree replacement
brew 'exa'

# ag
brew 'the_silver_searcher'

# grep replacement
brew 'ripgrep'

# git + hub extension
brew 'git'
brew 'hub'

# cloud
brew 'azure-cli'
brew 'awscli'

# yarn
brew 'yarn'

# python
brew 'python'

# node
brew 'node'
brew 'nvm'

# terraform
brew 'terraform'
brew 'tflint'

# misc
brew 'openssl'
brew 'fx'
brew 'jq'
brew 'rclone'
brew 'exiftool'
brew 'imagemagick'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Fonts
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

cask 'font-hasklig-nerd-font'
cask 'font-hasklig-nerd-font-mono'
cask 'font-menlo-for-powerline'
cask 'font-fira-code'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Applications
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# terminal emulator
cask 'alacritty'

# bar
cask 'ubersicht'

# utils
cask 'alfred'

# browsers
cask 'google-chrome'
cask 'firefox-developer-edition'

# comms
cask 'slack'
cask 'discord'
cask 'telegram'

# dev
cask 'docker'
cask 'insomnia'
cask 'miniconda'
