# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# CLI
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# core
brew 'coreutils'

# shell
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

# multiplexer
# brew 'tmux'

# better cat
brew 'bat'

# sed
# brew 'gnu-sed'

# git + hub extension
brew 'git'
# brew 'git-delta'
# brew 'hub'

# docker
cask 'docker'
# brew 'lazydocker'
# brew 'dive'

# yarn
# brew 'yarn'

# python
brew 'python'

# node
# brew 'node'

# misc
brew 'openssl'
brew 'jq'
brew 'exiftool'
brew 'tree'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Applications
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# editor
cask 'visual-studio-code'
cask 'sublime-text'

# mouse sidebuttons
cask 'sensiblesidebuttons'

# browsers
cask 'google-chrome'
cask 'firefox'

# comms
cask 'slack'
cask 'discord'
cask 'telegram'
cask 'grammarly'

# players
cask 'vlc'
cask 'spotify'

# password manager
cask '1password'

cask 'datagrip'
cask 'microsoft-teams'
cask 'todoist'
brew 'jupyterlab'
brew 'kubernetes-cli'
brew 'nmap'
brew 'numpy'
brew 'opencv'
brew 'pyenv'
brew 'youtube-dl'
